hparracho/Xarmlib/external/FSL/fsl_mkv46f16_features.h
/* @brief Has OSC1 external oscillator. */
#define FSL_FEATURE_OSC_HAS_OSC1 (0)
/* @brief Has OSC0 external oscillator. */
#define FSL_FEATURE_OSC_HAS_OSC0 (0)
/* @brief Has OSC external oscillator (without index). */
#define FSL_FEATURE_OSC_HAS_OSC (0)
/* @brief Number of OSC external oscillators. */
#define FSL_FEATURE_OSC_OSC_COUNT (0)
/* @brief Has external reference clock divider (register bit field DIV[ERPS]). */
#define FSL_FEATURE_OSC_HAS_EXT_REF_CLOCK_DIVIDER (1)

/* PDB module features */

/* @brief Define the count of supporting ADC pre-trigger for each channel. */
#define FSL_FEATURE_PDB_ADC_PRE_CHANNEL_COUNT (4)
/* @brief Has DAC support. */
#define FSL_FEATURE_PDB_HAS_DAC (1)
/* @brief Has shared interrupt handler (has not individual interrupt handler for each channel). */
#define FSL_FEATURE_PDB_HAS_SHARED_IRQ_HANDLER (0)

/* PIT module features */

/* @brief Number of channels (related to number of registers LDVALn, CVALn, TCTRLn, TFLGn). */
#define FSL_FEATURE_PIT_TIMER_COUNT (4)
/* @brief Has lifetime timer (related to existence of registers LTMR64L and LTMR64H). */
#define FSL_FEATURE_PIT_HAS_LIFETIME_TIMER (0)
/* @brief Has chain mode (related to existence of register bit field TCTRLn[CHN]). */
#define FSL_FEATURE_PIT_HAS_CHAIN_MODE (1)
/* @brief Has shared interrupt handler (has not individual interrupt handler for each channel). */
#define FSL_FEATURE_PIT_HAS_SHARED_IRQ_HANDLER (0)
/* @brief Has timer enable control. */
#define FSL_FEATURE_PIT_HAS_MDIS (1)

/* PMC module features */

/* @brief Has Bandgap Enable In VLPx Operation support. */
#define FSL_FEATURE_PMC_HAS_BGEN (1)
/* @brief Has Bandgap Buffer Enable. */
#define FSL_FEATURE_PMC_HAS_BGBE (1)
/* @brief Has Bandgap Buffer Drive Select. */
#define FSL_FEATURE_PMC_HAS_BGBDS (1)
/* @brief Has Low-Voltage Detect Voltage Select support. */
#define FSL_FEATURE_PMC_HAS_LVDV (1)
/* @brief Has Low-Voltage Warning Voltage Select support. */
#define FSL_FEATURE_PMC_HAS_LVWV (1)
/* @brief Has LPO. */
#define FSL_FEATURE_PMC_HAS_LPO (0)
/* @brief Has VLPx option PMC_REGSC[VLPO]. */
#define FSL_FEATURE_PMC_HAS_VLPO (0)
/* @brief Has acknowledge isolation support. */
#define FSL_FEATURE_PMC_HAS_ACKISO (1)
/* @brief Has Regulator In Full Performance Mode Status Bit PMC_REGSC[REGFPM]. */
#define FSL_FEATURE_PMC_HAS_REGFPM (0)
/* @brief Has Regulator In Run Regulation Status Bit PMC_REGSC[REGONS]. */
#define FSL_FEATURE_PMC_HAS_REGONS (1)
/* @brief Has PMC_HVDSC1. */
#define FSL_FEATURE_PMC_HAS_HVDSC1 (0)
/* @brief Has PMC_PARAM. */
#define FSL_FEATURE_PMC_HAS_PARAM (0)
/* @brief Has PMC_VERID. */
#define FSL_FEATURE_PMC_HAS_VERID (0)

/* PORT module features */

/* @brief Has control lock (register bit PCR[LK]). */
#define FSL_FEATURE_PORT_HAS_PIN_CONTROL_LOCK (1)
/* @brief Has open drain control (register bit PCR[ODE]). */
#define FSL_FEATURE_PORT_HAS_OPEN_DRAIN (1)
/* @brief Has digital filter (registers DFER, DFCR and DFWR). */
#define FSL_FEATURE_PORT_HAS_DIGITAL_FILTER (1)
/* @brief Has DMA request (register bit field PCR[IRQC] values). */
#define FSL_FEATURE_PORT_HAS_DMA_REQUEST (1)
/* @brief Has pull resistor selection available. */
#define FSL_FEATURE_PORT_HAS_PULL_SELECTION (1)
/* @brief Has pull resistor enable (register bit PCR[PE]). */
#define FSL_FEATURE_PORT_HAS_PULL_ENABLE (1)
/* @brief Has slew rate control (register bit PCR[SRE]). */
#define FSL_FEATURE_PORT_HAS_SLEW_RATE (1)
/* @brief Has passive filter (register bit field PCR[PFE]). */
#define FSL_FEATURE_PORT_HAS_PASSIVE_FILTER (1)
/* @brief Has drive strength control (register bit PCR[DSE]). */
#define FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH (1)
/* @brief Has separate drive strength register (HDRVE). */
#define FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH_REGISTER (0)
/* @brief Has glitch filter (register IOFLT). */
#define FSL_FEATURE_PORT_HAS_GLITCH_FILTER (0)
/* @brief Defines width of PCR[MUX] field. */
#define FSL_FEATURE_PORT_PCR_MUX_WIDTH (3)
/* @brief Has dedicated interrupt vector. */
#define FSL_FEATURE_PORT_HAS_INTERRUPT_VECTOR (1)
/* @brief Has multiple pin IRQ configuration (register GICLR and GICHR). */
#define FSL_FEATURE_PORT_HAS_MULTIPLE_IRQ_CONFIG (0)
/* @brief Defines whether PCR[IRQC] bit-field has flag states. */
#define FSL_FEATURE_PORT_HAS_IRQC_FLAG (0)
/* @brief Defines whether PCR[IRQC] bit-field has trigger states. */
#define FSL_FEATURE_PORT_HAS_IRQC_TRIGGER (0)

/* PWM module features */

#if defined(CPU_MKV46F128VLH16) || defined(CPU_MKV46F256VLH16)
    /* @brief Number of each EflexPWM module channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNEL_COUNT (8U)
    /* @brief Number of EflexPWM module A channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELA_COUNT (4U)
    /* @brief Number of EflexPWM module B channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELB_COUNT (4U)
    /* @brief Number of EflexPWM module X channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELX_COUNT (0U)
    /* @brief Number of each EflexPWM module compare channels interrupts. */
    #define FSL_FEATURE_PWM_CMP_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module reload channels interrupts. */
    #define FSL_FEATURE_PWM_RELOAD_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module capture channels interrupts. */
    #define FSL_FEATURE_PWM_CAP_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module reload error channels interrupts. */
    #define FSL_FEATURE_PWM_RERR_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module fault channels interrupts. */
    #define FSL_FEATURE_PWM_FAULT_INT_HANDLER_COUNT (1U)
    /* @brief Number of submodules in each EflexPWM module. */
    #define FSL_FEATURE_PWM_SUBMODULE_COUNT (4U)
#elif defined(CPU_MKV46F128VLL16) || defined(CPU_MKV46F256VLL16)
    /* @brief Number of each EflexPWM module channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNEL_COUNT (12U)
    /* @brief Number of EflexPWM module A channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELA_COUNT (4U)
    /* @brief Number of EflexPWM module B channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELB_COUNT (4U)
    /* @brief Number of EflexPWM module X channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELX_COUNT (4U)
    /* @brief Number of each EflexPWM module compare channels interrupts. */
    #define FSL_FEATURE_PWM_CMP_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module reload channels interrupts. */
    #define FSL_FEATURE_PWM_RELOAD_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module capture channels interrupts. */
    #define FSL_FEATURE_PWM_CAP_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module reload error channels interrupts. */
    #define FSL_FEATURE_PWM_RERR_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module fault channels interrupts. */
    #define FSL_FEATURE_PWM_FAULT_INT_HANDLER_COUNT (1U)
    /* @brief Number of submodules in each EflexPWM module. */
    #define FSL_FEATURE_PWM_SUBMODULE_COUNT (4U)
#endif /* defined(CPU_MKV46F128VLH16) || defined(CPU_MKV46F256VLH16) */

